# Read and write CSV and XLS files

In [51]:
import pandas as pd

In [52]:
#INSTALL: pip3 install xlrd

#read excel file
data_df=pd.read_excel('weather_data.xlsx')
data_df

          day  temperature  windspeed  event
0  2017-01-01         32.0          6   Rain
1  2017-02-01         35.0          7  Sunny
2  2017-03-01         28.0          2   Snow
3  2017-04-01         24.0          7   Snow
4  2017-05-01         32.0          4   Rain
5  2017-06-01         31.0          2  Sunny
6  2017-06-02          NaN          4  Sunny
7  2017-06-03          NaN          5   Rain
8  2017-06-04         45.0          7   Rain
9  2017-06-05         31.0          7   Rain
10 2017-06-06         27.0          3    NaN
11 2017-06-07         25.0          6  Sunny

In [53]:
data_df.shape

(12, 4)

In [54]:
data_df.head(3)

         day  temperature  windspeed  event
0 2017-01-01         32.0          6   Rain
1 2017-02-01         35.0          7  Sunny
2 2017-03-01         28.0          2   Snow

In [55]:
data_df.tail(2)

          day  temperature  windspeed  event
10 2017-06-06         27.0          3    NaN
11 2017-06-07         25.0          6  Sunny

In [56]:
data_df.columns

Index(['day', 'temperature', 'windspeed', 'event'], dtype='object')

In [57]:
#checking null values
data_df.isna().sum()

day            0
temperature    2
windspeed      0
event          1
dtype: int64

In [58]:
#datatypes of columns
data_df.dtypes

day            datetime64[ns]
temperature           float64
windspeed               int64
event                  object
dtype: object

In [59]:
#checking frequency of events
data_df['event'].value_counts()

Rain     5
Sunny    4
Snow     2
Name: event, dtype: int64

In [60]:
# adding new column in existing data frame
data_df['temp_windspeed']=data_df['temperature']+data_df['windspeed']
data_df

          day  temperature  windspeed  event  temp_windspeed
0  2017-01-01         32.0          6   Rain            38.0
1  2017-02-01         35.0          7  Sunny            42.0
2  2017-03-01         28.0          2   Snow            30.0
3  2017-04-01         24.0          7   Snow            31.0
4  2017-05-01         32.0          4   Rain            36.0
5  2017-06-01         31.0          2  Sunny            33.0
6  2017-06-02          NaN          4  Sunny             NaN
7  2017-06-03          NaN          5   Rain             NaN
8  2017-06-04         45.0          7   Rain            52.0
9  2017-06-05         31.0          7   Rain            38.0
10 2017-06-06         27.0          3    NaN            30.0
11 2017-06-07         25.0          6  Sunny            31.0

In [61]:
#write DF to csv
data_df.to_csv('data_manipulated.csv')

In [62]:
# INSTALL: pip3 install openpyxl

#write DF to Excel
data_df.to_excel('data_manipulated.xlsx',sheet_name="data_from_python")

# GROUP-BY

In [63]:
# import weather_data_cities
 #weather by cities
city_data=pd.read_csv('weather_data_cities.csv')
city_data

           day      city state  temperature  windspeed   event
0   01-01-2017  new york     A           32          6    Rain
1   01-02-2017  new york     C           36          7   Sunny
2   01-03-2017  new york     B           28         12    Snow
3   01-04-2017  new york     A           33          7   Sunny
4   01-01-2017    mumbai     D           90          5   Sunny
5   01-02-2017    mumbai     D           85         12     Fog
6   01-03-2017    mumbai     D           87         15     Fog
7   01-04-2017    mumbai     E           92          5    Rain
8   01-01-2017     paris     F           45         20   Sunny
9   01-02-2017     paris     F           50         13  Cloudy
10  01-03-2017     paris     G           54          8  Cloudy
11  01-04-2017     paris     G           42         10  Cloudy

In [64]:
#perform group by city
grp=city_data.groupby('city')
grp

In [74]:
city_data.dtypes

day            object
city           object
state          object
temperature     int64
windspeed       int64
event          object
dtype: object

In [67]:
#print groups

for city,city_grp in grp:
    print(city)
    print(city_grp)

mumbai
          day    city state  temperature  windspeed  event
4  01-01-2017  mumbai     D           90          5  Sunny
5  01-02-2017  mumbai     D           85         12    Fog
6  01-03-2017  mumbai     D           87         15    Fog
7  01-04-2017  mumbai     E           92          5   Rain
new york
          day      city state  temperature  windspeed  event
0  01-01-2017  new york     A           32          6   Rain
1  01-02-2017  new york     C           36          7  Sunny
2  01-03-2017  new york     B           28         12   Snow
3  01-04-2017  new york     A           33          7  Sunny
paris
           day   city state  temperature  windspeed   event
8   01-01-2017  paris     F           45         20   Sunny
9   01-02-2017  paris     F           50         13  Cloudy
10  01-03-2017  paris     G           54          8  Cloudy
11  01-04-2017  paris     G           42         10  Cloudy

In [70]:
#or to get specific group
grp.get_group('new york')

          day      city state  temperature  windspeed  event
0  01-01-2017  new york     A           32          6   Rain
1  01-02-2017  new york     C           36          7  Sunny
2  01-03-2017  new york     B           28         12   Snow
3  01-04-2017  new york     A           33          7  Sunny

In [72]:
#Find maximum temperature in each of the cities
grp.max()

                 day state  temperature  windspeed  event
city
mumbai    01-04-2017     E           92         15  Sunny
new york  01-04-2017     C           36         12  Sunny
paris     01-04-2017     G           54         20  Sunny

In [73]:
#averge of temperature and windspeed for groups

grp.mean()

          temperature  windspeed
city
mumbai          88.50       9.25
new york        32.25       8.00
paris           47.75      12.75

In [75]:
#describe groups
grp.describe()

         temperature                                                   \
               count   mean       std   min    25%   50%    75%   max
city
mumbai           4.0  88.50  3.109126  85.0  86.50  88.5  90.50  92.0
new york         4.0  32.25  3.304038  28.0  31.00  32.5  33.75  36.0
paris            4.0  47.75  5.315073  42.0  44.25  47.5  51.00  54.0

         windspeed
             count   mean       std  min   25%   50%    75%   max
city
mumbai         4.0   9.25  5.057997  5.0  5.00   8.5  12.75  15.0
new york       4.0   8.00  2.708013  6.0  6.75   7.0   8.25  12.0
paris          4.0  12.75  5.251984  8.0  9.50  11.5  14.75  20.0

# concatenate Data Frames

In [82]:
import pandas as pd
india_weather = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
    "humidity": [80, 60, 78]
})

india_weather

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [83]:
us_weather = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
    "humidity": [68, 65, 75]
})
us_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [79]:
#concate two dataframes- append
df=pd.concat([india_weather,us_weather])
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [80]:
#if you want continuous index
df=pd.concat([india_weather,us_weather],ignore_index=True)
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
3  new york           21        68
4   chicago           14        65
5   orlando           35        75

In [88]:
#concatenate vertically
df=pd.concat([india_weather,us_weather],axis=1)
df

       city  temperature  humidity      city  temperature  humidity
0    mumbai           32        80  new york           21        68
1     delhi           45        60   chicago           14        65
2  banglore           30        78   orlando           35        75

# Merge DataFrames

In [89]:
temperature_df = pd.DataFrame({
    "city": ["mumbai","delhi","banglore", 'hyderabad'],
    "temperature": [32,45,30,40]})
temperature_df

        city  temperature
0     mumbai           32
1      delhi           45
2   banglore           30
3  hyderabad           40

In [90]:
humidity_df = pd.DataFrame({
    "city": ["delhi","mumbai","banglore"],
    "humidity": [68, 65, 75]})
humidity_df

       city  humidity
0     delhi        68
1    mumbai        65
2  banglore        75

In [91]:
#merge two dataframes with out explicitly mention index

inner_join=pd.merge(temperature_df,humidity_df,on='city')
inner_join

       city  temperature  humidity
0    mumbai           32        65
1     delhi           45        68
2  banglore           30        75

In [92]:
#OUTER-JOIN
outer_join=pd.merge(temperature_df,humidity_df,on='city',how='outer')
outer_join

        city  temperature  humidity
0     mumbai           32      65.0
1      delhi           45      68.0
2   banglore           30      75.0
3  hyderabad           40       NaN

# Numerical Indexing (.loc vs iloc)

In [10]:
import pandas as pd
import numpy as np

In [20]:
df = pd.DataFrame([100,20,35,4,50,60,7,8,9,19], index=[49,48,47,46,45, 1, 2, 3, 4, 5])
df

      0
49  100
48   20
47   35
46    4
45   50
1    60
2     7
3     8
4     9
5    19

In [14]:
df.loc[:45]

     0
49   1
48  20
47   3
46   4
45  50

In [15]:
df.loc[46:]

     0
46   4
45  50
1    6
2    7
3    8
4    9
5   19

In [16]:
df.loc[46:3]

     0
46   4
45  50
1    6
2    7
3    8

In [21]:
df.iloc[:3]

      0
49  100
48   20
47   35

In [22]:
df.loc[45]

0    50
Name: 45, dtype: int64